'''
This module stores basic data,
they are default when not set otherwise.
'''

##player and user
DECK = (['C级卡']*55+['B级卡']*40+['S级卡']*35+
        ['R级卡']*30+['SR级卡']*25+['SSR级卡']*1+
        ['抗感染卡']*1+['镇静剂卡']*1+
        ['维生素卡']*1+['抗生素卡']*1+
        ['食物卡']*5+['水卡']*5)

PLAYER = dict(
    money=100, day=1, status='NORMAL',
    hunger=100, thirst=100, sanity=100,
    attr1='', attr2='', attr3='', attr4='', attr5='',
    attrs=None, 
    C级卡=0, B级卡=0, S级卡=0, R级卡=0, SR级卡=0, SSR级卡=0,
    抗感染卡=0, 镇静剂卡=0, 维生素卡=0,
    抗生素卡=0, 食物卡=0, 水卡=0,
    deck=DECK,
    isNewGame=None,
    )

USER = dict(
    username='(default)', storyOn=True, bgmOn=True,
    lastLoginTime=0, #seconds since the epoch
    DustOfFate=0, fate={},
    achievement={},
    )

FATE_KEYS = [
    'resist_hunger', 'resist_thirst', 'resist_disord',
    'absorb_hunger', 'absorb_thirst', 'absorb_sanity',
    'food', 'water', 'medi', 'ssr',
    'dust', 'money',
    ]
for key in FATE_KEYS:
    '''level 0'''
    USER['fate'][key] = 0

ACHIEVEMENT_KEYS = [
    'hunger', 'thirst', 'insane', 'happy', 'killed',
    ]
for key in ACHIEVEMENT_KEYS:
    USER['achievement'][key] = False

K_PLAYER = PLAYER.keys()
K_USER   = USER  .keys()

##
DDL = 10
#ddl should be larger than 10

ATTRS = [
    '银行家', #影响收入
    '方丈', '肥宅', #影响饥饿
    '酒鬼', #影响水分
    '股民', #影响精神
    '僧侣', '贝爷', '骰王',
    '大妈', '商人', #买卖
    ]

ATTR_HELP_DICT = dict(
    银行家='将钱存在银行里。\n每天记30%的利息。\ncombo信息\n银行家+股民：抽不到生存类卡只扣1点精神。',
    方丈='降低每日的体力损耗。\ncombo信息\n方丈+僧侣：除死刑外，不会死亡。',
    肥宅='提升获得食物卡的概率。\n增加每日的体力损耗。\ncombo信息\n酒鬼+肥宅：每天的体力与水分损耗均为5。',
    酒鬼='提升获得水卡的概率。\n增加每日的水分损耗。\ncombo信息\n酒鬼+肥宅：每天的体力与水分损耗均为5。',
    股民='增加每日的精神恢复量。\n降低抽不到生存类卡时的精神损耗。\ncombo信息\n银行家+股民：抽不到生存类卡只扣1点精神。',
    僧侣='不会因精神问题死亡。\ncombo信息\n方丈+僧侣：除死刑外，不会死亡。',
    贝爷='提升获得生存类卡的概率。',
    骰王='提升获得SSR级卡的概率。\n即使本局未获得此属性，\n仍遗留部分效果。',
    大妈='讨价还价。\n降低购买卡片的费用。\ncombo信息\n大妈+商人：购买所有卡片的价格均为1。',
    商人='卖卡所得加倍。\ncombo信息\n大妈+商人：购买所有卡片的价格均为1。',
    )

FATE_LEVEL_DICT = dict(
    resist_hunger={
        0:'每日体力损耗减少0点', 1:'每日体力损耗减少10点', 2:'每日体力损耗减少20点', 3:'每日体力损耗减少30点', 4:'已达到最高等级',
        },
    resist_thirst={
        0:'每日水分损耗减少0点', 1:'每日水分损耗减少10点', 2:'每日水分损耗减少20点', 3:'每日水分损耗减少30点', 4:'已达到最高等级',
        },
    resist_disord={0:'不易生病——等级0', 1:'不易生病——等级1', 2:'不易生病——等级2', 3:'不易生病——等级3', 4:'已达到最高等级'},
    absorb_hunger={0:'食物卡多恢复0点体力', 1:'食物卡多恢复5点体力', 2:'食物卡多恢复10点体力', 3:'食物卡多恢复15点体力', 4:'已达到最高等级'},
    absorb_thirst={0:'水卡多恢复0点水分', 1:'水卡多恢复5点水分', 2:'水卡多恢复10点水分', 3:'水卡多恢复15点水分', 4:'已达到最高等级'},
    absorb_sanity={0:'镇静剂卡多恢复0点精神', 1:'镇静剂卡多恢复5点精神', 2:'镇静剂卡多恢复10点精神', 3:'镇静剂卡多恢复15点精神', 4:'已达到最高等级'},
    food ={0:'提升抽到食物卡的概率——等级0', 1:'提升抽到食物卡的概率——等级1', 2:'提升抽到食物卡的概率——等级2', 3:'提升抽到食物卡的概率——等级3', 4:'已达到最高等级'},
    water={0:'提升抽到水卡的概率——等级0', 1:'提升抽到水卡的概率——等级1', 2:'提升抽到水卡的概率——等级2', 3:'提升抽到水卡的概率——等级3', 4:'已达到最高等级'},
    medi ={0:'提升抽到医疗类卡的概率——等级0', 1:'提升抽到医疗类卡的概率——等级1', 2:'提升抽到医疗类卡的概率——等级2', 3:'提升抽到医疗类卡的概率——等级3', 4:'已达到最高等级'},
    ssr  ={0:'提升"骰王"效果——等级0', 1:'提升"骰王"效果——等级1', 2:'提升"骰王"效果——等级2', 3:'提升"骰王"效果——等级3', 4:'已达到最高等级'},
    dust ={0:'命运尘埃结算时增加0%', 1:'命运尘埃结算时增加10%', 2:'命运尘埃结算时增加20%', 3:'命运尘埃结算时增加30%', 4:'已达到最高等级'},
    money={0:'每日收入增加0%', 1:'每日收入增加10%', 2:'每日收入增加20%', 3:'每日收入增加30%', 4:'已达到最高等级'},
    )
LIVINGCARDS = ['水卡','食物卡','抗生素卡','维生素卡','镇静剂卡','抗感染卡'] #生存卡

TIPLIST_GAME = [
    '生病时，\n睡觉并不会恢复你的精神，\n反而会让你更沮丧。',
    '抽不到生存类卡，\n你的精神会遭受打击。',
    '发烧会把你迅速蒸干。',
    '抽到SSR级卡时，\n你的精神会有所恢复。',
    '坏血是因为缺乏维生素。',
    '抗生素卡可以治愈你的发热。',
    '生存类卡是绿色的。',
    '精神值低到一定程度，\n你会在睡眠中gg。',
    '精神值过低时，\n抽到SSR级卡会当场gg。',
    '这里有不少有价值的信息。',
    '今天天气不错。',
    ]
TIPLIST_FATE = [
    '失败是成功之母。\n用前世的教训为今生救赎吧！',
    ]
TIPLIST_TRADE= [
    '我是一台自动售货机。',
    '今天天气不错。',
    '在这里买卖卡片。',
    '买卡是很贵的。',
    ]
